## Pandas Tutorial

In [10]:
import pandas as pd

### Read CSV, Excel, Json

In [16]:
# df = pd.read_csv('sales_data_sample.csv', encoding='latin1')
# df = pd.read_excel('SampleSuperstore.xlsx', engine='xlrd')
df = pd.read_json('sample_Data.json')

### Save to CSV, Excel, Json

In [22]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}

df = pd.DataFrame(data)
df
# df.to_csv('output_data.csv', index=False)
# df.to_excel('output_data.xlsx', index=False)
# df.to_json('output_data.json', orient='records', lines=True)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

### Head, Tail

In [82]:
df = pd.read_json('sample_Data.json')
# print(df.head())  # default is 5
print(df.tail(3))

    id                              name  \
17  18    iRobot Roomba i7+ Robot Vacuum
18  19  Ninja Foodi Digital Air Fry Oven
19  20  Cuisinart ICE-70 Ice Cream Maker

                                          description   price        category  \
17  The iRobot Roomba i7+ Robot Vacuum features au...  799.99  Home & Kitchen
18  The Ninja Foodi Digital Air Fry Oven features ...  209.99  Home & Kitchen
19  The Cuisinart ICE-70 Ice Cream Maker features ...  139.99  Home & Kitchen

                                                image
17  https://store.irobot.com/default/i7-vacuuming-...
18  https://www.ninjakitchen.com/static/img/produc...
19  https://www.cuisinart.com/share/images/product...

### Dataset Details

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   name         20 non-null     object
 2   description  20 non-null     object
 3   price        20 non-null     float64
 4   category     20 non-null     object
 5   image        20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB

In [31]:
df.describe()  # Summary statistics for numerical columns

             id        price
count  20.00000    20.000000
mean   10.50000   507.687000
std     5.91608   373.008199
min     1.00000   129.950000
25%     5.75000   244.237500
50%    10.50000   374.990000
75%    15.25000   724.742500
max    20.00000  1599.990000

### Properties

In [36]:
df.shape  # Returns the shape of the DataFrame (rows, columns)

(20, 6)

In [34]:
df.columns

Index(['id', 'name', 'description', 'price', 'category', 'image'], dtype='object')

### Access Data

In [40]:
df['name'].head()  # Accessing a single column

0                                Apple iPhone 12
1                             Samsung Galaxy S21
2                             Sony PlayStation 5
3              LG OLED55CXPUA 55-inch 4K OLED TV
4    Bose QuietComfort 35 II Wireless Headphones
Name: name, dtype: object

In [47]:
df[['name', 'price']].head()  # Accessing multiple columns

                                          name    price
0                              Apple iPhone 12   999.00
1                           Samsung Galaxy S21   799.00
2                           Sony PlayStation 5   499.99
3            LG OLED55CXPUA 55-inch 4K OLED TV  1599.99
4  Bose QuietComfort 35 II Wireless Headphones   299.00

### Filter

In [52]:
df = df[df['price'] > 800]  # Filtering rows based on a condition
df.head()

,id,name,description,price,category,image
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...
9,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...

In [ ]:
df = df[(df['price'] > 800) & (df['category'] == 'Electronics')]  # Multiple conditions -- AND
df.head()

,id,name,description,price,category,image
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...
9,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...

In [ ]:
df = df[(df['price'] > 800) | (df['category'] == 'Electronics')]  # Multiple conditions -- OR
df

,id,name,description,price,category,image
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...
9,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...

### Insert columns

In [61]:
df['discount'] = df['price'] * 0.1  # Inserting a new column with a calculation
df.insert(0, 'EmployeeID', range(1, len(df) + 1))  # Inserting a new column at a specific position
df.head()

,EmployeeID,id,name,description,price,category,image,discount
0,1,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...,99.900
3,2,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...,159.999
9,3,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...,89.900

### Updating Values

In [71]:
df.loc[1,'price'] = 100     # row_number, column_name
df['price'] = df['price']*0.2  # 20% HIKE
df.head()

,id,name,description,price,category,image
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,39.9600,Electronics,https://www.apple.com/newsroom/images/product/...
1,2,Samsung Galaxy S21,The Samsung Galaxy S21 features a 6.2-inch Dyn...,20.0000,Electronics,https://images.samsung.com/is/image/samsung/p6...
2,3,Sony PlayStation 5,The Sony PlayStation 5 features an AMD Zen 2-b...,19.9996,Electronics,https://www.sony.com/image/44baa604124b770c824...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,63.9996,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...
4,5,Bose QuietComfort 35 II Wireless Headphones,The Bose QuietComfort 35 II Wireless Headphone...,11.9600,Electronics,https://assets.bose.com/content/dam/Bose_DAM/W...

### Deleting or Removing Records

In [73]:
df.drop(columns=['category'], inplace=True)  # Deleting a column

### Missing Data

In [83]:
# NAN (Not a Number) handling -- for numerical columns
# None (Null) handling -- for objects

df.isnull().sum()  # Count of missing values in each column
df.loc[2, 'price'] = None  # Setting a value to None
df.isnull().sum()  # Check again for missing values --> 1 in price column

id             0
name           0
description    0
price          1
category       0
image          0
dtype: int64

#### Handling Missing Data - Fill or Drop

In [ ]:
# df.dropna(inplace=True)  # Drop rows with any missing values
df.fillna(0, inplace=True)  # Fill missing values with 0  or df.fillna(df.mean(), inplace=True)  # Fill numerical columns with mean

In [89]:
df['price'][2]

np.float64(0.0)

#### Interpolation - Fill Estimated Value  -- Time series data

In [100]:
#Linear, polynomial, time, etc. 
# df.insert(0, 'valueID', range(1, len(df) + 1))  # Insert a new column at the beginning
df.isnull().sum()  # Check for missing values in 'value' column

valueID        0
id             0
name           0
description    0
price          0
category       0
image          0
value          4
dtype: int64

In [107]:
df.infer_objects(copy=False)        # Changes columns of object dtype to a more specific type (int, float, datetime) if possible.
df.isnull().sum()  # Check for missing values after interpolation

valueID        0
id             0
name           0
description    0
price          0
category       0
image          0
value          0
dtype: int64

In [111]:
# Bad way (may warn)
# df['valueID'][2:4] = None  

# Good way
df.loc[2:3, 'valueID'] = None 
df.isnull().sum()  # Check for missing values in 'valueID' column

valueID        2
id             0
name           0
description    0
price          0
category       0
image          0
value          0
dtype: int64

In [112]:
df.interpolate(method='linear', inplace=True)  # Interpolating missing values
df.isnull().sum()  # Check for missing values after interpolation

C:\Users\ojhaa\AppData\Local\Temp\ipykernel_2100\3080335153.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method='linear', inplace=True)  # Interpolating missing values

valueID        0
id             0
name           0
description    0
price          0
category       0
image          0
value          0
dtype: int64

### Sorting and Aggregation

In [ ]:
df.sort_values(by='price', ascending=False, inplace=True)  # Sorting by 'price' in descending order -- one column
# df.sort_values(by=['category', 'price'], ascending=[True, False], inplace=True)  # Sorting by multiple columns
df.head()

,valueID,id,name,description,price,category,image,value
3,4.0,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...,4.0
0,1.0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...,1.0
9,10.0,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...,10.0
17,18.0,18,iRobot Roomba i7+ Robot Vacuum,The iRobot Roomba i7+ Robot Vacuum features au...,799.99,Home & Kitchen,https://store.irobot.com/default/i7-vacuuming-...,18.0
1,2.0,2,Samsung Galaxy S21,The Samsung Galaxy S21 features a 6.2-inch Dyn...,799.00,Electronics,https://images.samsung.com/is/image/samsung/p6...,2.0

In [ ]:
grouped = df.groupby('category')['price'].sum()  # Grouping by 'category'
# grouped = df.groupby('category').agg({'price': 'sum', 'discount': 'mean'})  # Aggregating multiple columns
# grouped = df.groupby(['category', 'subcategory'])['price'].sum()  # Grouping by multiple columns

In [115]:
grouped

category
Electronics        6253.87
Home & Kitchen     2699.89
Home Appliances     699.99
Name: price, dtype: float64

### Merging

In [116]:
df_customers = pd.DataFrame({
    "CustomerID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"]
})

df_orders = pd.DataFrame({
    "OrderID": [101, 102, 103],
    "CustomerID": [1, 2, 1],
    "Amount": [250, 150, 300]   
})

In [123]:
df_merged = pd.merge(df_customers, df_orders, on='CustomerID', how='inner')  # Inner join / outer join / left join / right join
df_merged  # Display the merged DataFrame

   CustomerID   Name  OrderID  Amount
0           1  Alice      101     250
1           1  Alice      103     300
2           2    Bob      102     150

### Concatenation

In [127]:
# Vertical concatenation (row-wise)
# Horizontal concatenation (column-wise)

df_added = pd.concat([df_customers, df_orders], axis=0)  # Concatenating vertically
df_added  # Display the concatenated DataFrame

   CustomerID     Name  OrderID  Amount
0           1    Alice      NaN     NaN
1           2      Bob      NaN     NaN
2           3  Charlie      NaN     NaN
0           1      NaN    101.0   250.0
1           2      NaN    102.0   150.0
2           1      NaN    103.0   300.0

In [ ]:
df_added2 = pd.concat([df_customers, df_orders], axis=1)  # Concatenating horizontally
df_added2  # Display the horizontally concatenated DataFrame

   CustomerID     Name  OrderID  CustomerID  Amount
0           1    Alice      101           1     250
1           2      Bob      102           2     150
2           3  Charlie      103           1     300

: